/*******************************Copyright (c)*********************************************
**                University of Electronic Science and Technology of China
**                  School of Communication and Information Engineering
**                          http://www.uestc.edu.cn
**
**--------------------------- File Info ---------------------------------------------------
** File name:           sort.cpp
** Last modified Date:  2012-12-19
** Last Version:        1.0
** Descriptions:        各种排序操作，针对顺序表进行排序，顺序表结构的定义在mystruct.h中，
**                      函数中使用的与界面显示有关接口的说明在ui.h
**                      本文件基于C语言风格
**------------------------------------------------------------------------------------------
** Created by:          Duan Jingshan
** Created date:        2012-12-19
**------------------------------------------------------------------------------------------
** Modified by:   
** Modified date: 
** Version:    
** Descriptions:  
**
*******************************************************************************************/
#include "stdafx.h"
#include "mystruct.h"
#include "ui.h"
/*******************************************************************************************
** Function name: simple_insert_sort()
** Descriptions	:	简单插入排序,按总成绩从小到大排序
**                  
** Input:	
**        table_t * table; 顺序表指针
** Output:
**        table_t * table; 排序后的顺序表
**   return:  类型：void;
** Created by	: 
** Created Date	: 
**------------------------------------------------------------------------------------------
** Modified by	:
** Modified Date: 
**------------------------------------------------------------------------------------------
*******************************************************************************************/
void simple_insert_sort(table_t * table)
{


}
/*******************************************************************************************
** Function name: simple_insert_sort()
** Descriptions	:	简单插入排序，按总成绩从小到大排序
**                  
** Input:	
**        table_t * table; 顺序表指针
** Output:
**        table_t * table; 排序后的顺序表
**   return:  类型：void;
** Created by	: 
** Created Date	: 
**------------------------------------------------------------------------------------------
** Modified by	:
** Modified Date: 
**------------------------------------------------------------------------------------------
*******************************************************************************************/
void simple_select_sort(table_t * table)
{

	


}
/*******************************************************************************************
** Function name: simple_insert_sort()
** Descriptions	:	简单插入排序,按总成绩从小到大排序
**                  
** Input:	
**        table_t * table; 顺序表指针
** Output:
**        table_t * table; 排序后的顺序表
**   return:  类型：void;
** Created by	: 
** Created Date	: 
**------------------------------------------------------------------------------------------
** Modified by	:
** Modified Date: 
**------------------------------------------------------------------------------------------
*******************************************************************************************/
void bubble_sort(table_t * table)
{

	

}
/*******************************************************************************************
** Function name: quick_sort()
** Descriptions	: 快速排序,按总成绩从小到大排序,这是一种递归算法
**                  
** Input:	
**        table_t * table; 顺序表指针
**        int first; 排序范围的上边沿
**        int last; 排序范围的下边沿
** Output:
**        table_t * table; 排序后的顺序表
**   return:  类型：void;
** Created by	: 
** Created Date	: 
**------------------------------------------------------------------------------------------
** Modified by	:
** Modified Date: 
**------------------------------------------------------------------------------------------
*******************************************************************************************/
void quick_sort(table_t * table,int first, int last)
{



}